RT-Thread/rt-thread/bsp/imxrt/imxrt1170-nxp-evk/board/board.c
                                            Pull Down Pull Up Field: Internal pulldown resistor enabled
                                            Open Drain Field: Disabled
                                            Domain write protection: Both cores are allowed
                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B2_00_SEMC_DATA16, /* GPIO_EMC_B2_00 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B2_01_SEMC_DATA17, /* GPIO_EMC_B2_01 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B2_02_SEMC_DATA18, /* GPIO_EMC_B2_02 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B2_03_SEMC_DATA19, /* GPIO_EMC_B2_03 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B2_04_SEMC_DATA20, /* GPIO_EMC_B2_04 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B2_05_SEMC_DATA21, /* GPIO_EMC_B2_05 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B2_06_SEMC_DATA22, /* GPIO_EMC_B2_06 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B2_07_SEMC_DATA23, /* GPIO_EMC_B2_07 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B2_08_SEMC_DM02, /* GPIO_EMC_B2_08 PAD functional properties : */
        0x04U);                          /* PDRV Field: high drive strength
                                            Pull Down Pull Up Field: Internal pullup resistor enabled
                                            Open Drain Field: Disabled
                                            Domain write protection: Both cores are allowed
                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B2_09_SEMC_DATA24, /* GPIO_EMC_B2_09 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B2_10_SEMC_DATA25, /* GPIO_EMC_B2_10 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B2_11_SEMC_DATA26, /* GPIO_EMC_B2_11 PAD functional properties : */
        0x04U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pullup resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B2_12_SEMC_DATA27, /* GPIO_EMC_B2_12 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B2_13_SEMC_DATA28, /* GPIO_EMC_B2_13 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B2_14_SEMC_DATA29, /* GPIO_EMC_B2_14 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B2_15_SEMC_DATA30, /* GPIO_EMC_B2_15 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B2_16_SEMC_DATA31, /* GPIO_EMC_B2_16 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B2_17_SEMC_DM03, /* GPIO_EMC_B2_17 PAD functional properties : */
        0x08U);                          /* PDRV Field: high drive strength
                                            Pull Down Pull Up Field: Internal pulldown resistor enabled
                                            Open Drain Field: Disabled
                                            Domain write protection: Both cores are allowed
                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B2_18_SEMC_DQS4, /* GPIO_EMC_B2_18 PAD functional properties : */
        0x08U);                          /* PDRV Field: high drive strength
                                            Pull Down Pull Up Field: Internal pulldown resistor enabled
                                            Open Drain Field: Disabled
                                            Domain write protection: Both cores are allowed
                                            Domain write protection lock: Neither of DWP bits is locked */
}
#endif

#ifdef BSP_USING_CAN
void imxrt_can_pins_init(void)
{
#ifdef BSP_USING_CAN3
    CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr); /* LPCG on: LPCG is ON. */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_LPSR_00_FLEXCAN3_TX, /* GPIO_LPSR_00 is configured as FLEXCAN3_TX */
        0U);                             /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_LPSR_01_FLEXCAN3_RX, /* GPIO_LPSR_01 is configured as FLEXCAN3_RX */
        0U);                             /* Software Input On Field: Input Path is determined by functionality */
#endif
}
#endif

void rt_hw_us_delay(rt_uint32_t us)
{
}

void rt_hw_board_init()
{
    BOARD_ConfigMPU();
    BOARD_InitPins();
    BOARD_BootClockRUN();

    NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_4);
    SysTick_Config(SystemCoreClock / RT_TICK_PER_SECOND);

#ifdef BSP_USING_LPUART
    imxrt_uart_pins_init();
#endif

#ifdef BSP_USING_SDRAM
   imxrt_sdram_pins_init();
#endif

#ifdef RT_USING_HEAP
    rt_system_heap_init((void *)HEAP_BEGIN, (void *)HEAP_END);
#endif

#ifdef RT_USING_COMPONENTS_INIT
    rt_components_board_init();
#endif

#ifdef RT_USING_CONSOLE
    rt_console_set_device(RT_CONSOLE_DEVICE_NAME);
#endif

#ifdef BSP_USING_SDIO
    imxrt_SDcard_pins_init();
#endif

#ifdef BSP_USING_ETH
    imxrt_eth_pins_init();
#endif

#ifdef BSP_USING_CAN
    imxrt_can_pins_init();
#endif
}

